package utils

import "regexp"

/*
移动：134 135 136 137 138 139 147 148 150 151 152 157 158 159 172 178 182 183 184 187 188 195 198
联通：130 131 132 145 146 155 156 166 167 171 175 176 185 186 196
电信：133 149 153 173 174 177 180 181 189 190 191 193 199
虚拟运营商：162 165 167 170 171
广电：190 192 196 197
*/

var VirtualPhoneNumberSegments = []string{
	`^162\d{8}$`,
	`^165\d{8}$`,
	`^167\d{8}$`,
	`^171\d{8}$`, // 联通也有 171
	`^170\d{8}$`, // 电信也有 170
}

var PhoneNumberWhiteList = []string{
	`^130\d{8}$`,
	`^131\d{8}$`,
	`^132\d{8}$`,
	`^133\d{8}$`,
	`^134\d{8}$`,
	`^135\d{8}$`,
	`^136\d{8}$`,
	`^137\d{8}$`,
	`^138\d{8}$`,
	`^139\d{8}$`,

	`^145\d{8}$`,
	`^146\d{8}$`,
	`^147\d{8}$`,
	`^148\d{8}$`,
	`^149\d{8}$`,
	`^150\d{8}$`,
	`^151\d{8}$`,
	`^152\d{8}$`,
	`^155\d{8}$`,
	`^156\d{8}$`,
	`^157\d{8}$`,
	`^158\d{8}$`,
	`^159\d{8}$`,

	`^166\d{8}$`,
	`^167\d{8}$`,

	`^170\d{8}$`, // 风险
	`^171\d{8}$`, // 风险
	`^172\d{8}$`,
	`^173\d{8}$`,
	`^174\d{8}$`,
	`^175\d{8}$`,
	`^176\d{8}$`,
	`^177\d{8}$`,
	`^178\d{8}$`,

	`^180\d{8}$`,
	`^181\d{8}$`,
	`^182\d{8}$`,
	`^183\d{8}$`,
	`^184\d{8}$`,
	`^185\d{8}$`,
	`^186\d{8}$`,
	`^187\d{8}$`,
	`^188\d{8}$`,
	`^189\d{8}$`,
	`^190\d{8}$`,
	`^191\d{8}$`,
	`^192\d{8}$`,
	`^193\d{8}$`,

	`^195\d{8}$`,
	`^196\d{8}$`,
	`^197\d{8}$`,
	`^198\d{8}$`,
	`^199\d{8}$`,
}

func IsVirtualPhoneNumber(s string) bool {
	for _, v := range VirtualPhoneNumberSegments {
		re := regexp.MustCompile(v)
		if res := re.Match([]byte(s)); res {
			if res {
				return true
			}
		}
	}
	return false
}

func IsNormalPhoneNumber(s string) bool {
	for _, v := range PhoneNumberWhiteList {
		re := regexp.MustCompile(v)
		if res := re.Match([]byte(s)); res {
			if res {
				return true
			}
		}
	}
	return false
}
